[
  {
    "id": "con2489",
    "name": "รัฐธรรมนูญแห่งราชอาณาจักรไทย พุทธศักราช 2489",
    "prelude": "xxx\n\nyyyy\n\n# Con 2489",

    "chapters": [
      {
        "id": 3,
        "chapterNumber": 6,
        "name": "อำนาจนิติบัญญัติ",
        "fromSectionId": 50,
        "toSectionId": 157,
        "parts": [
          {
            "id": 4,
            "name": "บทที่ใช้แก่สภาทั้งสอง",
            "fromSectionId": 50,
            "toSectionId": 113
          }
        ]
      }
    ],

    "sections": [
      {
        "id": 54,
        "content": "ร่างพระราชบัญญัติที่สภาผู้แทนได้ลงมติให้ใช้ได้และได้เสนอไปยังพฤฒสภานั้น พฤฒสภาจะต้องพิจารณาและลงมติภายในกำหนดสามสิบวัน แต่ถ้าร่างพระราชบัญญัตินั้นเป็นร่างพระราชบัญญัติเกี่ยวด้วยการเงิน พฤฒสภาจะต้องพิจารณาและลงมติภายในกำหนดสิบห้าวัน\\n\\nกำหนดวันดั่งกล่าวในวรรคก่อน ให้หมายถึงวันในสมัยประชุม และให้เริ่มนับแต่วันที่ร่างพระราชบัญญัตินั้นได้มาถึงพฤฒสภา\\n\\nถ้าพฤฒสภาไม่ได้พิจารณาลงมติในร่างพระราชบัญญัติที่สภาผู้แทนส่งมาภายในกำหนดเวลาที่กล่าวในวรรคแรก ก็ให้ถือว่าพฤฒสภาได้ให้ความเห็นชอบในร่างพระราชบัญญัตินั้น",
        "chapterId": 3,
        "chapterName": "อำนาจนิติบัญญัติ",
        "partId": 5,
        "partName": "บทที่ใช้แก่สภาทั้งสอง"
      },
      {
        "id": 56,
        "content": "พฤฒสภาและสภาผู้แทน มีอำนาจควบคุมราชการแผ่นดิน โดยบทบัญญัติแห่งรัฐธรรมนูญนี้",
        "chapterId": 3,
        "chapterName": "อำนาจนิติบัญญัติ",
        "partId": 5,
        "partName": "บทที่ใช้แก่สภาทั้งสอง"
      },
      {
        "id": 57,
        "content": "ในที่ประชุมของพฤฒสภาหรือสภาผู้แทน สมาชิกทุกคนมีสิทธิตั้งกระทู้ถามรัฐมนตรีในข้อความใด ๆ อันเกี่ยวกับการงานในหน้าที่ได้ แต่รัฐมนตรีย่อมมีสิทธิที่จะไม่ตอบ เมื่อเห็นว่าข้อความนั้น ๆ ยังไม่ควรเปิดเผยเพราะเกี่ยวกับความปลอดภัยหรือประโยชน์สำคัญของแผ่นดิน",
        "chapterId": 3,
        "chapterName": "อำนาจนิติบัญญัติ",
        "partId": 5,
        "partName": "บทที่ใช้แก่สภาทั้งสอง"
      },
      {
        "id": 59,
        "content": "พฤฒสภาและสภาผู้แทนมีอำนาจเลือกสมาชิกในสภาตั้งเป็นคณะกรรมาธิการสามัญ และมีอำนาจเลือกบุคคลที่เป็นสมาชิกหรือมิได้เป็นสมาชิกในสภาก็ตามเป็นคณะกรรมาธิการวิสามัญ เพื่อกระทำกิจการหรือพิจารณาสอบสวนข้อความใด ๆ อันอยู่ในวงงานของสภา แล้วรายงานต่อสภา คณะกรรมาธิการที่กล่าวนี้ ย่อมมีอำนาจเรียกบุคคลใด ๆ มาชี้แจงแสดงความเห็นในกิจการที่กระทำหรือพิจารณาอยู่นั้นได้\\n\\nเอกสิทธิที่บัญญัติไว้ในมาตรา 42 นั้น ให้คุ้มครองถึงบุคคลผู้กระทำหน้าที่ตามมาตรานี้ด้วย",
        "chapterId": 3,
        "chapterName": "อำนาจนิติบัญญัติ",
        "partId": 5,
        "partName": "บทที่ใช้แก่สภาทั้งสอง"
      }
    ]
  },

  {
    "id": "con2492",
    "name": "รัฐธรรมนูญแห่งราชอาณาจักรไทย พุทธศักราช 2492",
    "prelude": "xxx\n\nyyyy\n\n# Con 2492",

    "chapters": [
      {
        "id": 6,
        "chapterNumber": 6,
        "name": "อำนาจนิติบัญญัติ",
        "fromSectionId": 79,
        "toSectionId": 157,
        "parts": [
          {
            "id": 1,
            "name": "บททั่วไป",
            "fromSectionId": 79,
            "toSectionId": 80
          },
          {
            "id": 2,
            "name": "วุฒิสภา",
            "fromSectionId": 81,
            "toSectionId": 150
          }
        ]
      }
    ],

    "sections": [
      {
        "id": 75,
        "content": "ร่างพระราชบัญญัติจะตราขึ้นเป็นกฎหมายได้ก็แต่โดยคำแนะนำและยินยอมของรัฐสภา",
        "chapterId": 6,
        "chapterName": "อำนาจนิติบัญญัติ",
        "partId": 1,
        "partName": "บททั่วไป"
      },
      {
        "id": 77,
        "content": "ร่างพระราชบัญญัติใดพระมหากษัตริย์ไม่ทรงเห็นชอบด้วยและพระราชทานคืนมายังรัฐสภา หรือมิได้พระราชทานคืนมาภายในเก้าสิบวัน รัฐสภาจะต้องปรึกษาร่างพระราชบัญญัตินั้นใหม่ ถ้ารัฐสภาลงมติยืนยันตามเดิมด้วยคะแนนเสียงไม่ต่ำกว่าสองในสามของจำนวนสมาชิกทั้งหมดของทั้งสองสภาแล้ว ให้นายกรัฐมนตรีนำร่างพระราชบัญญัตินั้นขึ้นทูลเกล้าฯ ถวายอีกครั้งหนึ่ง เมื่อพระมหากษัตริย์มิได้ทรงลงพระปรมาภิไธยพระราชทานลงมาภายในสามสิบวัน ก็ให้นำพระราชบัญญัตินั้นประกาศในราชกิจจานุเบกษาใช้บังคับเป็นกฎหมายได้ เสมือนหนึ่งว่าพระมหากษัตริย์ได้ทรงลงพระปรมาภิไธยแล้ว",
        "chapterId": 6,
        "chapterName": "อำนาจนิติบัญญัติ",
        "partId": 1,
        "partName": "บททั่วไป"
      },
      {
        "id": 82,
        "content": "วุฒิสภาประกอบด้วยสมาชิกมีจำนวนหนึ่งร้อยคน ซึ่งพระมหากษัตริย์ ทรงเลือกและแต่งตั้งจากผู้มีสิทธิสมัครรับเลือกตั้งเป็นสมาชิกสภาผู้แทน และมีอายุไม่ต่ำกว่าสี่สิบปี บริบูรณ์ซึ่งทรงพระราชดำริเห็นว่าเป็นผู้ทรงคุณวุฒิ โดยมีความรู้ความชำนาญในวิชาการหรือกิจการต่าง ๆ อันจะยังประโยชน์ให้เกิดแก่การปกครองแผ่นดิน ให้ประธานองคมนตรีเป็นผู้ลงนามรับสนองพระบรมราชโองการแต่งตั้งสมาชิกวุฒิสภา\\n ..",
        "chapterId": 6,
        "chapterName": "อำนาจนิติบัญญัติ",
        "partId": 2,
        "partName": "วุฒิสภา"
      }
    ]
  },
  {
    "id": "con2560",
    "name": "รัฐธรรมนูญแห่งราชอาณาจักรไทย พุทธศักราช 2560",
    "prelude": "xxx\n\nyyyy\n\n# Con 2460",

    "chapters": [
      {
        "id": 7,
        "chapterNumber": 7,
        "name": "รัฐสภา",
        "fromSectionId": 79,
        "toSectionId": 157,
        "parts": [
          {
            "id": 3,
            "name": "วุฒิสภา",
            "fromSectionId": 107,
            "toSectionId": 113
          }
        ]
      },
      {
        "id": 17,
        "chapterNumber": null,
        "name": "บทเฉพาะกาล",
        "fromSectionId": 262,
        "toSectionId": 279
      }
    ],

    "sections": [
      {
        "id": 107,
        "content": "วุฒิสภาประกอบด้วยสมาชิกจำนวนสองร้อยคน ซึ่งมาจาก\\n การเลือกกันเองของบุคคลซึ่งมีความรู้ ความเชี่ยวชาญ ประสบการณ์ อาชีพ ลักษณะ หรือประโยชน์ร่วมกัน หรือ\\n ..",
        "chapterId": 7,
        "chapterName": "รัฐสภา",
        "partId": 3,
        "partName": "วุฒิสภา"
      },
      {
        "id": 269,
        "content": "ในวาระเริ่มแรก ให้วุฒิสภาประกอบด้วยสมาชิกจำนวน\\n สองร้อยห้าสิบคน ซึ่งพระมหากษัตริย์ทรงแต่งตั้งตามที่\\n คณะรักษาความสงบแห่งชาติถวายคำแนะนำ โดยในการ\\n ....",
        "chapterId": 17,
        "chapterName": "บทเฉพาะกาล",
        "partId": null,
        "partName": null,
        "amendmentIds": [1]
      }
    ]
  }
]
